
     D Name            S             50A
     D Result          S             52A

     C                   Eval      Name = 'George'
     C                   Eval      Result = 'Hello, ' + %Trim(Name) + '!'
     C                   Dsply                   Result
     C                   Return
